tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "melkeydev/melkey"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "withgraphite/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Record and share terminal sessions
brew "asciinema"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# User-friendly launcher for Bazel
brew "bazelisk"
# Version manager for neovim
brew "bob"
# Format bazel BUILD files with a standard convention
brew "buildifier"
# Rewrite bazel BUILD files using standard commands
brew "buildozer"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# More intuitive version of du in rust
brew "dust"
# Platform built on V8 to build network applications
brew "node"
# AST-based pattern checker for JavaScript
brew "eslint"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Golang formatter that fixes long lines
brew "golines"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Draw UML diagrams
brew "plantuml"
# Fast, disk space efficient package manager
brew "pnpm"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Simple keystroke visualizer
brew "showkey"
# Cross-shell prompt for astronauts
brew "starship"
# Simple terminal image viewer written in Rust
brew "viu"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Allows you to manage your stacked changes and submit them for review on GitHub
brew "withgraphite/tap/graphite"
# OpenJDK distribution from Amazon
cask "corretto"
# Adds an OpenGL renderer to the ZDoom source port
cask "gzdoom"
# Vector graphics editor
cask "inkscape"
# Open-source keystroke visualizer
cask "keycastr"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Web browser
cask "librewolf"
# App to manage software development and track bugs
cask "linear-linear"
# Plain-text file notepad and todo-list manager
cask "qownnotes"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Text editor for code, markup and prose
cask "sublime-text"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
