tap "frank-mayer/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "incu6us/tap"
tap "melkeydev/melkey"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "theykk/tap"
tap "withgraphite/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Record and share terminal sessions
brew "asciinema"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# User-friendly launcher for Bazel
brew "bazelisk"
# BibTeX bibliography file pretty printer and syntax checker
brew "bibclean"
# Version manager for neovim
brew "bob"
# Format bazel BUILD files with a standard convention
brew "buildifier"
# Rewrite bazel BUILD files using standard commands
brew "buildozer"
# Software library to render fonts
brew "freetype"
# Check Java source against a coding standard
brew "checkstyle"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Static analysis of C and C++ code
brew "cppcheck"
# Pack, ship and run any application as a lightweight container
brew "docker"
# More intuitive version of du in rust
brew "dust"
# Platform built on V8 to build network applications
brew "node"
# AST-based pattern checker for JavaScript
brew "eslint"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Golang formatter that fixes long lines
brew "golines"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Convert images to PDF via direct JPEG inclusion
brew "img2pdf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Next-gen compiler infrastructure
brew "llvm"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Minimalist GNU for Windows and GCC cross-compilers
brew "mingw-w64"
# Shell command parallelization utility
brew "parallel"
# Port of pdftk in java
brew "pdftk-java"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Manage compile and link flags for libraries
brew "pkg-config"
# Draw UML diagrams
brew "plantuml"
# Fast, disk space efficient package manager
brew "pnpm"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Used as a compiler wrapper and avoids compilation when possible
brew "sccache"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Simple keystroke visualizer
brew "showkey"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Terminal multiplexer
brew "tmux"
# Simple terminal image viewer written in Rust
brew "viu"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Right imports sorting & code formatting tool
brew "incu6us/tap/goimports-reviser"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Switch between your git profiles easily
brew "theykk/tap/git-switcher"
# Allows you to manage your stacked changes and submit them for review on GitHub
brew "withgraphite/tap/graphite"
# OpenJDK distribution from Amazon
cask "corretto"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Collection of alternate languages for LibreOffice
cask "libreoffice-language-pack"
# App to manage software development and track bugs
cask "linear-linear"
# Replacement for Docker Desktop
cask "orbstack"
# Plain-text file notepad and todo-list manager
cask "qownnotes"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Multiplayer code editor
cask "zed"
